---
kind: method
id: M:Autodesk.Revit.DB.RoutingConditions.#ctor(Autodesk.Revit.DB.RoutingPreferenceErrorLevel)
source: html/a389a129-58a8-237a-570f-29424960166a.htm
---
# Autodesk.Revit.DB.RoutingConditions.#ctor Method

Constructs a new instance of a RoutingConditions object with an indicated
 error level for conditions that do not meet any routing preference rule.

## Syntax (C#)
```csharp
public RoutingConditions(
	RoutingPreferenceErrorLevel errorLevel
)
```

## Parameters
- **errorLevel** (`Autodesk.Revit.DB.RoutingPreferenceErrorLevel`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration